// 位运算  
// 左移   右移    十进制转二进制


// 按位操作
  // 按位与  &
  // 两位都是1 才是1  
//   8 & 7 = 0
//     1000
//     0111
// 得到0000

  // 按位或  |
  // 有一个是1 就是1
//   8 | 7 = 15
//     1000
//     0111
// 得到1111

  // 按位异或  ^
  // 两位不同 就是1
//   8 & 7 = 15
//     1000
//     0111
// 得到1111


// 两数相加  不使用四则运算
// a + b = (a ^ b) + ((a & b) << 1)

function sum(a, b) {
  if (a === 0) return b
  if (b === 0) return a
  let newA = a ^ b 
  let newB = (a & b) << 1
  return sum(newA ,newB)
}
console.log(sum(9, 3))
